# Reading DataFrame

In [1]:
url = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv"

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv(url)

In [4]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,5/20/20,5/21/20,5/22/20,5/23/20,5/24/20,5/25/20,5/26/20,5/27/20,5/28/20,5/29/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,187,193,205,216,218,219,220,227,235,246
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,31,31,31,31,32,32,33,33,33,33
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,568,575,582,592,600,609,617,623,630,638
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,51,51,51,51,51,51,51,51,51,51
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,3,3,3,4,4,4,4,4,4,4

In [9]:
df.tail()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,5/20/20,5/21/20,5/22/20,5/23/20,5/24/20,5/25/20,5/26/20,5/27/20,5/28/20,5/29/20
261,NaN,Sao Tome and Principe,0.186360,6.613081,0,0,0,0,0,0,...,8,8,8,8,8,11,12,12,12,12
262,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,30,33,33,39,42,44,49,53,57,65
263,NaN,Comoros,-11.645500,43.333300,0,0,0,0,0,0,...,1,1,1,1,1,1,1,2,2,2
264,NaN,Tajikistan,38.861034,71.276093,0,0,0,0,0,0,...,41,44,44,44,46,46,47,47,47,47
265,NaN,Lesotho,-29.609988,28.233608,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [8]:
len(df)

266

In [15]:
df.shape

(266, 133)

In [19]:
df.columns

Index(['Province/State', 'Country/Region', 'Lat', 'Long', '1/22/20', '1/23/20',
       '1/24/20', '1/25/20', '1/26/20', '1/27/20',
       ...
       '5/20/20', '5/21/20', '5/22/20', '5/23/20', '5/24/20', '5/25/20',
       '5/26/20', '5/27/20', '5/28/20', '5/29/20'],
      dtype='object', length=133)

In [25]:
df.index

RangeIndex(start=0, stop=266, step=1)

In [33]:
df.iloc[:,:7].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 266 entries, 0 to 265
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Province/State  81 non-null     object
 1   Country/Region  266 non-null    object
 2   Lat             266 non-null    float64
 3   Long            266 non-null    float64
 4   1/22/20         266 non-null    int64
 5   1/23/20         266 non-null    int64
 6   1/24/20         266 non-null    int64
dtypes: float64(2), int64(3), object(2)
memory usage: 14.7+ KB

In [35]:
type(df['Country/Region'])

pandas.core.series.Series

# Creating DataFrame

In [38]:
a = ['Aaqib', 'Danish', 'Nazish', 'Shahnaj', 'Nicey']

In [44]:
type(a[0])

str

In [39]:
b = ['Male', 'Male', 'Male', 'Female', 'Female']

In [40]:
c = [19, 29, 24, 28, 22]

In [45]:
df_new = pd.DataFrame({"Name":a, "Sex":b, "Age":c})

In [46]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Sex     5 non-null      object
 2   Age     5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [49]:
df_new.head()

      Name     Sex  Age
0    Aaqib    Male   19
1   Danish    Male   29
2   Nazish    Male   24
3  Shahnaj  Female   28
4    Nicey  Female   22

In [80]:
df_new.values[0]

array(['Aaqib', 'Male', 19], dtype=object)

In [66]:
df_new[:3]

     Name   Sex  Age
0   Aaqib  Male   19
1  Danish  Male   29
2  Nazish  Male   24

In [64]:
df_new.iloc[:3,:2]

     Name   Sex
0   Aaqib  Male
1  Danish  Male
2  Nazish  Male

In [62]:
df_new.loc[:3,['Name']]

      Name
0    Aaqib
1   Danish
2   Nazish
3  Shahnaj

In [56]:
df_new[['Name','Sex']]

      Name     Sex
0    Aaqib    Male
1   Danish    Male
2   Nazish    Male
3  Shahnaj  Female
4    Nicey  Female

# SQL Operations

In [85]:
df_new.Sex

0      Male
1      Male
2      Male
3    Female
4    Female
Name: Sex, dtype: object

In [88]:
df_new.groupby('Sex').agg({"Age":"max"})

        Age
Sex
Female   28
Male     29